GeneralMayo/LittleBrother/nRF5_SDK_11.0.0_89a8197/examples/ble_peripheral/FinalProject549/main.c

/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
#include "bsp.h"
#include "bsp_btn_ble.h"

#include "our_service.h"
#include "device_info_service.h"
#include "temperature_service.h"
#include "flash_operations.h"
#include "SEGGER_RTT.h"

#include "app_uart.h"

/*UART buffer size. */
#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 1

#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define CENTRAL_LINK_COUNT               0                                          /**<number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**<number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                      "Little_Brother"	                         					/**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 300                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       180                                        /**< The advertising timeout in units of seconds. */

#define APP_TIMER_PRESCALER              0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE          4                                          /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(100, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(200, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                   1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                         /**< Maximum encryption key size. */

#define RAM_LOG_STORAGE                  4

#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static dm_application_instance_t        m_app_handle;                               /**< Application identifier allocated by device manager */

static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */

//Declare service structures
ble_os_t m_our_service;
ble_dis_t device_info_service;
ble_tss_t temperature_service;

//Declare global flash variables
flash_addresses flash_addr;
bool storing_in_flash = false;
bool loading_from_flash = false;
bool clearing_flash = false;
pstorage_handle_t       base_handle;
temp_log temp_ram_storage[RAM_LOG_STORAGE];
uint32_t ram_store_idx = 0;


// Declare an app_timer id + define timer interval and define a timer interval
APP_TIMER_DEF(m_our_char_timer_id);
#define OUR_CHAR_TIMER_INTERVAL     APP_TIMER_TICKS(3000, APP_TIMER_PRESCALER) // 3000 ms intervals
                                   
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

static void power_manage(void);
// Event Notification Handler.
static void example_cb_handler(pstorage_handle_t  * handle,
                               uint8_t              op_code,
                               uint32_t             result,
                               uint8_t            * p_data,
                               uint32_t             data_len)
{
    printf("test\n");
    APP_ERROR_CHECK(result);
    switch(op_code)
    {
       case PSTORAGE_CLEAR_OP_CODE:
           clearing_flash = false;
           break;
       case PSTORAGE_LOAD_OP_CODE:
           loading_from_flash = false;
           break;
       case PSTORAGE_STORE_OP_CODE:
           storing_in_flash = false;
           break;
    }
}

// Timer event handler
static void timer_timeout_handler(void * p_context)
{
    uint32_t err_code;
    // Update temperature and characteristic value.
    int32_t temperature = 0;
    static int32_t previous_temperature = 0;
    static uint32_t time = 0;
    //static 
    
    // Get temperature from on chip sensor
    sd_temp_get(&temperature);
    time+=1;
    
    temp_log most_recent_log;
    most_recent_log.id = 1;//TODO enter actual characteristic
    most_recent_log.time = time*3;
    most_recent_log.value = temperature;
    
    static uint16_t cur_conn_handle = BLE_CONN_HANDLE_INVALID;
    static uint16_t prev_conn_handle = BLE_CONN_HANDLE_INVALID;
    
    //if a device was just connected... just send the log
    if(cur_conn_handle != prev_conn_handle && prev_conn_handle == BLE_CONN_HANDLE_INVALID){
      printf("First Connection\n");
      termperature_characteristic_update(&temperature_service,
                                        most_recent_log);
    } else {
      if(ram_store_idx<RAM_LOG_STORAGE){
        temp_ram_storage[ram_store_idx] = most_recent_log;
        ram_store_idx = ram_store_idx+1;
        
//        uint8_t  cccd_value_buf[2];
//        ble_gatts_value_t gatts_value;
//        memset(&gatts_value, 0, sizeof(gatts_value));
//        gatts_value.len     = 2;
//        gatts_value.offset  = 0;
//        gatts_value.p_value = cccd_value_buf;
//        //err_code=sd_ble_gatts_value_get(temperature_service.conn_handle,
//        //  temperature_service.log_num_handle.cccd_handle,
//        //  &gatts_value);
//        APP_ERROR_CHECK(err_code);
//
//        //update log_num
//        *(gatts_value.p_value) = (uint16_t)(*(gatts_value.p_value))+1;
//
//        //set log_num
//        //err_code=sd_ble_gatts_value_set(temperature_service.conn_handle,
//        //  temperature_service.log_num_handle.cccd_handle,
//        //  &gatts_value);
//        APP_ERROR_CHECK(err_code);
      }
    }
    //connection valid
      //send ram
      //send next val
    //connection invalid && ram size < max
      //store log in ram
   
    //store data
    if(false){
    if(!storing_in_flash){
      printf("Storing RAM\n");
      temp_ram_storage[ram_store_idx] = most_recent_log;
      ram_store_idx++;

      //termperature_characteristic_update(&temperature_service, &temperature, &time);	
      // Save current temperature until next measurement
      previous_temperature = temperature;
      nrf_gpio_pin_toggle(LED_4);
    }
    }
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

