GeneralMayo/LittleBrother/nRF5_SDK_11.0.0_89a8197/examples/ble_peripheral/FinalProject549/main.c
    uint32_t old_logs[RAM_LOG_STORAGE];
    bool logs_in_flash = false;

    // Enter main loop.
    for (;;)
    {
       
      if(false){
        //check if flash storage necessary
        if(ram_store_idx == RAM_LOG_STORAGE){
          printf("Storing Flash\n");
          //turn off timer
          //err_code = app_timer_stop(m_our_char_timer_id);
          //APP_ERROR_CHECK(err_code);
          //turn off adv
          //err_code = sd_ble_gap_adv_stop();
          //APP_ERROR_CHECK(err_code);
          // Request to write RAM_LOG_STORAGE*bytes/elem bytes to block at an offset of 0 bytes.
          storing_in_flash = true;
          err_code = pstorage_store(&base_handle, temp_ram_storage, 16, 0);
          APP_ERROR_CHECK(err_code);
          logs_in_flash = true;
          ram_store_idx = 0;
          while(storing_in_flash){
            //power_manage();
          }
        }
        
        
        //check if stored logs need to be uploaded
        if(logs_in_flash && m_conn_handle != BLE_CONN_HANDLE_INVALID){
          printf("Loading Flash\n");
          // Request to read 4 bytes from block at an offset of 12 bytes.
          loading_from_flash = true;
          err_code = pstorage_load(old_logs, &base_handle, 16, 0);
          APP_ERROR_CHECK(err_code);
          while(loading_from_flash){
            power_manage();
          }
          printf("Loading...\n");
          for(int i = 0; i<RAM_LOG_STORAGE; i++){
            printf("%u ",old_logs[i]);
          }
          printf("\n");
          logs_in_flash = false;

          //clear flash page
          clearing_flash = true;
          err_code = pstorage_clear(&base_handle, 16);
          APP_ERROR_CHECK(err_code);
          while(clearing_flash){
            power_manage();
          }
        }
      }
        power_manage();
    }
}

/**
 * @}
 */


